In [46]:
import pandas as pd
import numpy as np

In [47]:
df=pd.read_csv("C:\\Users\\srmve\\OneDrive\\Documents\\age.csv")
df.head()

,name,birthday,title,character_name,character_year,characterage,character_gender,love_interest,release_date,actor_age
0,Ben Platt,24-09-1993,The Politician,Payton Hobart,hs senior,NaN,M,"Alice Charles, Astrid Sloan, River Barkley",27-09-2019,26.0
1,Zoey Deutch,10-11-1994,The Politician,Infinity Jackson,hs senior,NaN,F,NaN,27-09-2019,24.0
2,Lucy Boynton,17-01-1994,The Politician,Astrid Sloan,hs senior,NaN,F,"Payton Hobart, River Barkley",27-09-2019,25.0
3,Julia Schlaepfer,03-03-1995,The Politician,Alice Charles,hs senior,NaN,F,"Payton Hobart, James Sullivan",27-09-2019,24.0
4,Laura Dreyfuss,22-08-1988,The Politician,McAfee Westbrook,hs senior,NaN,F,Skye Leighton,27-09-2019,31.0

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 243 entries, 0 to 242
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   name              243 non-null    object
 1   birthday          227 non-null    object
 2   title             243 non-null    object
 3   character_name    243 non-null    object
 4   character_year    111 non-null    object
 5   characterage      131 non-null    float64
 6   character_gender  243 non-null    object
 7   love_interest     132 non-null    object
 8   release_date      243 non-null    object
 9   actor_age         227 non-null    float64
dtypes: float64(2), object(8)
memory usage: 19.1+ KB

In [49]:
df.describe()

       characterage   actor_age
count    131.000000  227.000000
mean      16.580153   21.977974
std        1.518877    3.908743
min       10.000000   11.000000
25%       16.000000   20.000000
50%       17.000000   22.000000
75%       17.000000   24.000000
max       25.000000   32.000000

In [50]:
df.isnull().sum()

name                  0
birthday             16
title                 0
character_name        0
character_year      132
characterage        112
character_gender      0
love_interest       111
release_date          0
actor_age            16
dtype: int64

In [51]:
df['birthday']=pd.to_datetime(df['birthday'])
df['birthday']

C:\Users\srmve\AppData\Local\Temp\ipykernel_15564\1446044272.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['birthday']=pd.to_datetime(df['birthday'])

0     1993-09-24
1     1994-11-10
2     1994-01-17
3     1995-03-03
4     1988-08-22
         ...
238          NaT
239   1991-10-19
240   1994-11-09
241   1998-04-20
242          NaT
Name: birthday, Length: 243, dtype: datetime64[ns]

In [52]:
df['birth_year']=df['birthday'].dt.year
df['birth_year']

0      1993.0
1      1994.0
2      1994.0
3      1995.0
4      1988.0
        ...
238       NaN
239    1991.0
240    1994.0
241    1998.0
242       NaN
Name: birth_year, Length: 243, dtype: float64

In [53]:
df = df.drop(['birthday','title','character_name', 'character_year', 'characterage', 'love_interest', 'release_date'],
axis=1)
df

                       name character_gender  actor_age  birth_year
0                 Ben Platt                M       26.0      1993.0
1               Zoey Deutch                F       24.0      1994.0
2              Lucy Boynton                F       25.0      1994.0
3          Julia Schlaepfer                F       24.0      1995.0
4            Laura Dreyfuss                F       31.0      1988.0
..                      ...              ...        ...         ...
238  Thomas Mitchell Barnet                M        NaN         NaN
239             Kevin Alves                M       28.0      1991.0
240          Asha Bromfield                F       25.0      1994.0
241           Felix Mallard                M       21.0      1998.0
242            Hallea Jones                F        NaN         NaN

[243 rows x 4 columns]

In [54]:
df.isnull().sum()

name                 0
character_gender     0
actor_age           16
birth_year          16
dtype: int64

In [55]:
from sklearn. preprocessing import LabelEncoder
label_encoder = LabelEncoder ()
categorical_columns = ['name', 'character_gender']
df[categorical_columns] = df[categorical_columns]. apply(label_encoder.fit_transform)
df[categorical_columns]

     name  character_gender
0      24                 1
1     239                 0
2     151                 0
3     126                 0
4     142                 0
..    ...               ...
238   229                 1
239   135                 1
240    18                 0
241    80                 1
242    94                 0

[243 rows x 2 columns]

In [56]:
from sklearn.impute import SimpleImputer
numeric_columns=['birth_year','actor_age']
df[numeric_columns]=SimpleImputer(strategy='most_frequent').fit_transform(df[numeric_columns])
df[numeric_columns]

     birth_year  actor_age
0        1993.0       26.0
1        1994.0       24.0
2        1994.0       25.0
3        1995.0       24.0
4        1988.0       31.0
..          ...        ...
238      1996.0       22.0
239      1991.0       28.0
240      1994.0       25.0
241      1998.0       21.0
242      1996.0       22.0

[243 rows x 2 columns]

In [57]:
df.isnull().sum()

name                0
character_gender    0
actor_age           0
birth_year          0
dtype: int64

In [58]:
x=df[['name','character_gender','birth_year']]
x

     name  character_gender  birth_year
0      24                 1      1993.0
1     239                 0      1994.0
2     151                 0      1994.0
3     126                 0      1995.0
4     142                 0      1988.0
..    ...               ...         ...
238   229                 1      1996.0
239   135                 1      1991.0
240    18                 0      1994.0
241    80                 1      1998.0
242    94                 0      1996.0

[243 rows x 3 columns]

In [59]:
y=df[['actor_age']]
y

     actor_age
0         26.0
1         24.0
2         25.0
3         24.0
4         31.0
..         ...
238       22.0
239       28.0
240       25.0
241       21.0
242       22.0

[243 rows x 1 columns]

In [60]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.25,random_state=42)

In [61]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()

In [62]:
model.fit(x_train,y_train)

LinearRegression()

In [63]:
y_pred=model.predict(x_test)
y_pred

array([[20.32550567],
       [23.92544966],
       [21.14452832],
       [17.24826853],
       [20.87066254],
       [19.37575922],
       [20.05842715],
       [19.58913837],
       [26.23259085],
       [20.30486507],
       [23.89964534],
       [26.92911212],
       [23.29629524],
       [20.918731  ],
       [22.17454378],
       [20.88528117],
       [21.95571959],
       [26.18815802],
       [19.87734148],
       [21.06875318],
       [21.85471705],
       [21.26742075],
       [22.23875898],
       [20.85317357],
       [19.38254648],
       [20.68336903],
       [28.55425525],
       [20.53659142],
       [21.13984858],
       [20.98848418],
       [21.37157493],
       [21.02661374],
       [21.20186332],
       [22.41907935],
       [21.18800998],
       [21.23760655],
       [24.13051345],
       [20.82928839],
       [24.04642294],
       [21.97483209],
       [22.9053731 ],
       [20.30257167],
       [20.83932023],
       [21.0311076 ],
       [20.48375028],
       [22.39385195],
       [20.28565964],
       [20.57692144],
       [21.33622275],
       [21.10917614],
       [25.42751449],
       [20.89674817],
       [21.66436484],
       [22.51635333],
       [18.37326457],
       [24.19234231],
       [20.92656237],
       [20.05479152],
       [20.98991934],
       [20.89445477],
       [20.25575249]])

In [64]:
from sklearn.metrics import mean_squared_error
mse=mean_squared_error(y_test,y_pred)
print(f"mean squared error:{mse}")

mean squared error:10.538206042177507

In [65]:
new_data = pd. DataFrame ({"name": [142], "character_gender": [1], "birth_year": [1996.0]})
predicted_age = model. predict(new_data)
print (f"Predicted Actor Age: {predicted_age [0]}")

Predicted Actor Age: [21.07018834]